#language: ru
Функционал: Яндекс маркет

  Сценарий: Выбор телевизора

    Когда выбран пункт меню "Маркет"

    Когда выбран раздел меню "Электроника"
    И выбран пункт меню Электроника "Телевизоры"

    Когда нажата кнопка Перейти ко всем фильтрам

    Когда заполняются поля:
      |Сумма от|20000|
    Тогда выбран производитель Samsung
    И выбран производитель LG

    Тогда нажата кнопка Показать подходящие
    Когда количество элементов товара 48

    Тогда поиск первого элемента из списка телевизоров
    И в строку поиска введено значение первого элемента

    Тогда проверка наименования товара Tv, соответствует запомненному значению


